package controller;

public interface BaseController {
    void initController(); // وقتی منو رو بخوایم عوض بکنیم ، این و صدا میکنیم
    //که بیاد برای ما این منو جدید و اماده بکنه ( صفحه رو لود کنه دیگه داوش )

    void handleinput(String command);

    void exit();//وقتی یه منو رو عوض کنیم باید منوی قبلی رو ببندیم
    // باید هرچیزی که از اون صفحه لود کرده بودیم و ببندیم و وارد یه صفحه جدید بشیم



    // داخل   exit , init ما به کلاس روتر داخل model میریم ، و تو اونجا کارهای مربوط به تغییر منو رو انجام میدیم
    // و کلا برای کار با کنترلر ، ما دیگه نمیایم بگیم کنترلر ساین اپ بیا ، یه کارنت کنترلر تعریف میکنیم و بهش کنترلر اون منو رو میدیم و کار میکنیم باهاش
    //صرفا این سوال هستش که روتر باید تو مدل باشع یا تو همین کنترلر باید هندل کنیم
    // ولی خب چون کارنت منیو و کارنت کنترلر تو مدل هستن بهتره تو همون مدل ولش کنیم دوایی
}
